/* ---------------------------------------------

	前后台任务范例
	后台任务

	作者： 杨为民 	2022-05
	QQ：   86547995

--------------------------------------------- */

// **** 系统定义 ****************
// ==== 单片机 SFR定义 ==========================
#include "uCx51_SFR_STC8H.h"

// ==== 库函数 ==========================
#include "stdio.h"

// **** 主函数 单片机程序入口 ****************
void main(void){  		
	float		X, Y, Z;
	
// ==== 单片机系统 初始化 ===========
// ---- 系统串口1 波特率 115200 Timer2 33.1776MHz -------------
			SCON = 0x50;		// 8位数据,可变波特率
			AUXR |= 0x01;		// 串口1选择定时器2为波特率发生器
			AUXR &= 0xFB;		// 定时器时钟12T模式
			T2L = 0xFA;			// 设置定时初始值
			T2H = 0xFF;			// 设置定时初始值
			AUXR |= 0x10;		// 定时器2开始计时
			PS   =0x01;			// 最高优先级
			ES  = 0;				// 不允许串口中断			
			TI	= 1;				// 发送缓冲区已清空
	
// ==== 后台任务主循环 ====================
Main_Loop:				
			printf("\r\n 请输入 X,Y<CR>");
			scanf("%f,%f", &X, &Y);
	
			Z=X+Y;
			printf("X+Y=%f", Z);
				
// ---- 后台任务主循环 结束 -----------------
			goto Main_Loop;		
}
