//********************************************************************
// 文件名称: STC32G_SYS.C 
// 功能说明: STC32G 系统基础初始化函数实现
// 整理编程: 浦晓明/浦江一水 2023-12-09  (参考STC资料)
//********************************************************************
#include "STC32G_SYS.H"

//系统初始化函数
void SYS_Init(void)
{
  WTST = 0;  //设置程序指令延时参数，赋值为0可将CPU执行指令的速度设置为最快
  EAXFR = 1; //扩展寄存器(XFR)访问使能
  CKCON = 0; //提高访问XRAM速度

  RSTFLAG |= 0x04;   //设置硬件复位后需要检测P3.2的状态选择运行区域，否则硬件复位后进入USB下载模式

  P0M1 = 0x00;   P0M0 = 0x00;   //设置为准双向口
  P1M1 = 0x00;   P1M0 = 0x00;   //设置为准双向口
  P2M1 = 0x00;   P2M0 = 0x00;   //设置为准双向口
  P3M1 = 0x00;   P3M0 = 0x00;   //设置为准双向口
  P4M1 = 0x00;   P4M0 = 0x00;   //设置为准双向口
  P5M1 = 0x00;   P5M0 = 0x00;   //设置为准双向口
  P6M1 = 0x00;   P6M0 = 0x00;   //设置为准双向口
  P7M1 = 0x00;   P7M0 = 0x00;   //设置为准双向口
}

void delay_ms(int count)  // /* X1ms */
{
     u16 i;
     do{
          i = MAIN_Fosc / 6000;
          while(--i);
     }while(--count);
}

void delay_us(int count)  // /* X1us */
{
        int i,j;
        for(i=0;i<count;i++)
                for(j=0;j<1;j++);
}